#!/usr/bin/env python
# -*- coding: utf-8 -*-
__author__ = 'Administrator'
import random


pukes_map = {
    0: u'大鬼',
    1: u'小鬼',
    415: u'黑桃2',
    414: u'黑桃A',
    413: u'黑桃K',
    412: u'黑桃Q',
    411: u'黑桃J',
    410: u'黑桃10',
    409: u'黑桃9',
    408: u'黑桃8',
    407: u'黑桃7',
    406: u'黑桃6',
    405: u'黑桃5',
    404: u'黑桃4',
    403: u'黑桃3',
    315: u'红桃2',
    314: u'红桃A',
    313: u'红桃K',
    312: u'红桃Q',
    311: u'红桃J',
    310: u'红桃10',
    309: u'红桃9',
    308: u'红桃8',
    307: u'红桃7',
    306: u'红桃6',
    305: u'红桃5',
    304: u'红桃4',
    303: u'红桃3',
    215: u'梅花2',
    214: u'梅花A',
    213: u'梅花K',
    212: u'梅花Q',
    211: u'梅花J',
    210: u'梅花10',
    209: u'梅花9',
    208: u'梅花8',
    207: u'梅花7',
    206: u'梅花6',
    205: u'梅花5',
    204: u'梅花4',
    203: u'梅花3',
    115: u'方块2',
    114: u'方块A',
    113: u'方块K',
    112: u'方块Q',
    111: u'方块J',
    110: u'方块10',
    109: u'方块9',
    108: u'方块8',
    107: u'方块7',
    106: u'方块6',
    105: u'方块5',
    104: u'方块4',
    103: u'方块3'
}

pukes_index = [0,1,415,414,413,412,411,410,409,408,407,406,405,404,403,315,314,313,312,311,310,309,308,307,306,305,304,303,215,214,213,212,211,210,209,208,207,206,205,204,203,115,114,113,112,111,110,109,108,107,106,105,104,103]
pukes = []
for k, v in pukes_map.iteritems():
    index = random.randrange(1, 54, 2)
    pukes_map.pop(index)
    pukes[k] = pukes_map.pop(index)
    pukes[index] = v

if __name__ == '__main__':
    print "54张牌的洗牌**********"
    for i in pukes:
        print u'第 %02d 张牌是：%s' % (i+1, pukes[i])

def puke_make(pukes):
    i = 53
    player = []
    while i >= 1:
        player.append(pukes.pop(i))
        i -= 3
    return player


